{
  "title": "Опыт работы",
  "intro": "Мой опыт работы позволил мне изучить разные аспекты разработки на Python. Я участвовал в различных проектах, где не только развил технические навыки, но и понял важность слушания и сотрудничества. Мой пользовательский подход заставляет меня постоянно искать способы улучшить продукты, которые я разрабатываю, чтобы они были функциональными и удобными.",
  "jobs": [
    {
      "position": "Full Stack разработчик",
      "company": "Eurasie en Analyse",
      "dates": "04/2024 – настоящее время, eurasieanalyse.fr",
      "description": [
        "Создание сайта для публикации статей и сбора отзывов, способствующий инициативе по обмену знаниями о Евразии.",
        "Полная разработка приложения, включая backend на Django и базу данных PostgreSQL, а также frontend технологии HTML5, CSS, Bootstrap, JavaScript и HTMX для современной и отзывчивой UI.",
        "Ключевые функции включают регистрацию пользователей, возможность комментировать статьи, персонализированные уведомления, профили пользователей, форму обратной связи и динамическое отображение контента.",
        "Развертывание и поддержка сайта, обеспечение высокой доступности и оптимальной производительности через мониторинг, регулярные обновления и оптимизации.",
        "Положительные отзывы об удобстве использования и эстетике сайта, подчеркивающие интуитивную навигацию, отзывчивый дизайн и визуальную привлекательность, что усилило влияние и охват платформы."
      ]
    },
    {
      "position": "Разработчик Python",
      "company": "Университет Париж-Сакле",
      "dates": "Июль 2022 – Октябрь 2022, Орсей, Франция",
      "description": [
        "Исправление критической ошибки, влияющей на корректность транзакций между пользователями, что позволило восстановить стабильную работу приложения.",
        "Частичный перепис проекта для оптимизации производительности, сократив время загрузки на 25% и повысив отзывчивость, что улучшило удовлетворенность пользователей.",
        "Реализация решения маршрутизации peer-to-peer, устраняющего необходимость в серверном хранилище, что позволило оптимизировать управление данными и повысить безопасность транзакций.",
        "Улучшение пользовательского интерфейса с помощью интеграции NetworkX для визуализации peer-to-peer транзакций, что сделало приложение более понятным и удобным.",
        "Подготовка подробной документации и тесное сотрудничество с командой для интеграции новых функций, обеспечивающих плавный переход и легкое принятие пользователями."
      ]
    },
    {
      "position": "Веб-разработчик",
      "company": "Сычуаньский педагогический университет",
      "dates": "04/2019 – 07/2019, Чэнду, Сычуань, Китай",
      "description": [
        "Проектирование интуитивного и адаптивного интерфейса, обеспечивающего плавную и приятную навигацию на всех устройствах — компьютерах, планшетах и смартфонах, с особым вниманием к эргономике и отзывчивости дизайна.",
        "Полная разработка приложения, включающая надежный backend на Java EE, производительную базу данных MySQL и интерактивный frontend с использованием HTML5, CSS3, Bootstrap, jQuery и AJAX для обеспечения динамичного пользовательского опыта.",
        "Реализация расширенной страницы регистрации с проверкой данных в реальном времени, предлагающей пользователю плавный и безопасный опыт, предотвращая ошибки и гарантируя целостность информации.",
        "Создание динамического поиска с мгновенной сортировкой для быстрого и интуитивного доступа к данным, улучшая эффективность навигации.",
        "Эффективная организация кода для избежания повторений, облегчая сопровождение и дальнейшее развитие приложения, снижая технический долг и обеспечивая устойчивое и оптимизированное развитие."
      ]
    }
  ],
  "meta": {
    "title": "Опыт Работы – Илия Глазунов",
    "description": "Изучите профессиональный путь Илии Глазунова как Python-разработчика, включая волонтёрские full stack проекты, роли Python-разработчика и опыт веб-разработки в различных средах.",
    "keywords": "опыт работы, Python-разработчик, full stack, Django, PostgreSQL, frontend, backend, веб-разработка, Илия Глазунов",
    "image": "/images/photo.jpg"
  }
}
