{
  "title": "Мои проекты",
  "intro": "Откройте для себя мои проекты, которые демонстрируют мои навыки разработки на Python, а также мою страсть к созданию полезных и увлекательных приложений. Будь то интерактивные игры или Telegram-боты, каждый проект был разработан, чтобы предложить приятный пользовательский опыт и решить конкретные задачи.",
  "projects": [
    {
      "title": "Модель классификации жалоб для TikTok",
      "description": "Для разработки предсказательной модели для TikTok, этот проект направлен на определение, содержит ли видео утверждение или выражает мнение. Основная цель проекта — уменьшить количество жалоб пользователей, требующих ручной модерации, и повысить эффективность обработки.",
      "link": "https://iliyasalve.github.io/business_card"
    },
    {
      "title": "Кейс-исследование Cyclistic",
      "description": "Этот проект анализирует использование велосипедов Cyclistic участниками с годовыми подписками и случайными пользователями. Цель — предоставить маркетинговые рекомендации для перевода случайных пользователей в ежегодных участников и улучшить удовлетворенность пользователей.",
      "link": "https://iliyasalve.github.io/business_card"
    },
    {
      "title": "Обнаружение спама с использованием NLTK",
      "description": "Для создания эффективного детектора спама для сообщений, этот проект использует технологии обработки естественного языка (NLP) с библиотекой NLTK. Включает предобработку данных, извлечение признаков и обучение модели Наивного Байеса.",
      "link": "https://iliyasalve.github.io/business_card"
    },
    {
      "title": "Классификация изображений кошек и собак",
      "description": "Этот проект включает в себя обучение сверточной нейронной сети (CNN) для классификации изображений кошек и собак. Модель способна распознавать признаки изображений для предсказания, представляет ли изображение кошку или собаку.",
      "link": "https://iliyasalve.github.io/business_card"
    },
    {
      "title": "Телеграм-бот о погоде",
      "description": "Телеграм-бот, который позволяет пользователям получать актуальную информацию о погоде для любого города. После выбора города пользователь получает данные о текущей погоде, включая температуру, температуру ощущаемую, а также минимальную и максимальную температуру на день.",
      "link": "https://iliyasalve.github.io/business_card"
    },
    {
      "title": "Многофункциональный Телеграм-бот",
      "description": "Телеграм-бот, созданный для упрощения жизни пользователей. С помощью этого бота можно генерировать сложные пароли любой длины, сокращать ссылки на различные ресурсы и запускать кости.",
      "link": "https://iliyasalve.github.io/business_card"
    },
    {
      "title": "Clicker Game",
      "description": "Кликер, в котором цель — набрать как можно больше очков. Игроки могут использовать накопленные очки для покупки множителей, значительно увеличивающих их результат.",
      "link": "https://iliyasalve.github.io/business_card"
    },
    {
      "title": "Игра в змейку",
      "description": "Игра в змейку, в которой цель — набрать как можно больше очков. Игроки имеют большой маневровый простор, что делает игру динамичной и увлекательной.",
      "link": "https://iliyasalve.github.io/business_card"
    }
  ],
    "meta": {
      "title": "Проекты – Илия Глазунов",
      "description": "Изучите проекты Илии Глазунова, демонстрирующие его экспертизу в разработке на Python, включая интерактивные игры, Telegram-боты и модели машинного обучения, все созданные для предоставления увлекательных и практичных решений.",
      "keywords": "проекты, разработка на Python, Telegram-боты, машинное обучение, игры, NLP, Илия Глазунов, разработка ПО",
      "image": "/images/photo.jpg"
    }
}
