{
  "title": "Навыки",
  "titleHard": "Профессиональные навыки",
  "titleSoft": "Личные качества",
  "introHard": "Технические навыки были приобретены в результате многолетнего обучения и практики. Я владею широким спектром языков программирования, фреймворков и инструментов, используемых в разработке ПО и анализе данных.",
  "introSoft": "Мягкие навыки играют ключевую роль в моей профессиональной деятельности. Я умею эффективно взаимодействовать с коллегами, быстро адаптироваться и проявлять инициативу.",
  "hardSkills": [
    {
        "name": "Python",
        "description": "Более 5 лет опыта разработки скриптов и веб-приложений с использованием Python. Включает работу с библиотеками для анализа данных, машинного обучения и искусственного интеллекта: Pandas, NumPy, Scikit-learn, TensorFlow, PyTorch. Опыт применения этих инструментов для анализа больших данных и разработки моделей ИИ.",
        "example": "В проектах я использовал Pandas и NumPy для обработки данных и создавал модели машинного обучения с помощью Scikit-learn и TensorFlow для классификации данных и прогнозирования."
    },
    {
        "name": "Django и PostgreSQL",
        "description": "Разработка веб-приложений с использованием Django, интеграция с PostgreSQL для управления данными пользователей и создания сложных запросов. Настройка серверной части для оптимальной обработки данных.",
        "example": "Я разработал адаптивный веб-сайт для Eurasie en Analyse с регистрацией пользователей и возможностью обратной связи."
    },
    {
        "name": "Data Science",
        "description": "Применение инструментов Data Science для анализа и визуализации данных с Matplotlib и Seaborn, а также создание моделей машинного обучения. Использовал Jupyter Notebooks для создания интерактивных отчетов и проведения экспериментов.",
        "example": "Разрабатывал анализ данных и визуализации на основе реальных данных с помощью Seaborn для выявления скрытых закономерностей."
    },
    {
        "name": "Машинное обучение и компьютерное зрение",
        "description": "Опыт работы с искусственным интеллектом и компьютерным зрением, включая создание нейронных сетей и обучение моделей с использованием TensorFlow, PyTorch, а также обработку изображений с OpenCV.",
        "example": "Разработал систему анализа изображений с использованием OpenCV для улучшения визуализации данных и автоматической классификации объектов."
    },
    {
        "name": "Git, Postman, Virtualenv, VS Code, Sublime Text",
        "description": "Использование этих инструментов для управления проектами, написания и тестирования кода, а также для обеспечения безопасности и удобства разработки.",
        "example": "Использую Git для контроля версий, что позволяет отслеживать изменения и координировать работу команды. Postman помогал тестировать API в проектах."
    },
    {
        "name": "Блокчейн и обработка естественного языка (NLP)",
        "description": "Опыт работы с технологиями блокчейн и обработкой естественного языка. Применение моделей NLP для анализа текстов и создание решений на базе блокчейна для безопасного обмена данными.",
        "example": "В проекте Париж-Сакле реализовал маршрутизацию данных на основе P2P-протокола с использованием блокчейна для повышения безопасности."
    }
    ],
  "softSkills": [
    {
        "name": "Организация и дисциплина в работе",
        "description": "Способен структурировать задачи, эффективно управлять временем и контролировать выполнение каждого этапа работы при сохранении высоких стандартов качества.",
        "example": "Во время разработки сайта Eurasie en Analyse я руководил проектом от концепции до запуска, организовывая работу так, чтобы не упустить ни одной детали."
    },
    {
        "name": "Любознательность и инициативность",
        "description": "Стремлюсь изучать новые технологии и методы для поиска лучших решений задач. Проявляю инициативу, предлагая и реализуя улучшения в проектах.",
        "example": "Во время работы над проектом в Университете Париж-Сакле я предложил и реализовал карту маршрутизации данных между пользователями, что позволило оптимизировать обмен информацией напрямую без необходимости хранения на сервере."
    },
    {
        "name": "Адаптивность к изменениям",
        "description": "Быстро адаптируюсь к новым требованиям и изменениям в проекте. Легко осваиваю новые инструменты и подходы для повышения эффективности.",
        "example": "В проекте Eurasie en Analyse я перешел на использование PostgreSQL для оптимизации работы базы данных, что повысило производительность приложения."
    },
    {
        "name": "Оперативность при решении задач",
        "description": "Быстро реагирую на новые вызовы и нахожу решения сложных проблем в кратчайшие сроки.",
        "example": "В Университете Париж-Сакле я оперативно исправил критическую ошибку в обработке данных, минимизировав риск их потери."
    },
    {
        "name": "Командная работа и сотрудничество",
        "description": "Эффективно работаю в команде, поддерживая открытую коммуникацию и достигая общих целей.",
        "example": "В проекте Eurasie en Analyse я тесно сотрудничал с редакторами контента для обеспечения бесперебойной работы сайта и своевременного внедрения новых функций."
    },
    {
        "name": "Решение проблем",
        "description": "Умею анализировать и решать сложные задачи с помощью данных и современных технологий.",
        "example": "Оптимизировал алгоритмы анализа данных с использованием инструментов Data Science, таких как Pandas, что привело к более быстрому обработке данных и принятию более обоснованных решений."
    }
    ],
    "meta": {
        "title": "Навыки – Илия Глазунов",
        "description": "Ознакомьтесь с техническими и мягкими навыками Илии Глазунова, включая экспертные знания в Python, Django, Data Science, машинном обучении, блокчейне, а также сильные профессиональные качества, такие как командная работа, адаптивность и решение проблем.",
        "keywords": "навыки, технические навыки, мягкие навыки, Python, Django, машинное обучение, блокчейн, анализ данных, командная работа, решение проблем, Илия Глазунов",
        "image": "/images/photo.jpg"
    }
}
