{
  "title": "Дополнительные курсы",
  "intro": "Для того чтобы оставаться на передовой технологических изменений, я прошел специализированные курсы, которые укрепляют мои навыки в таких областях, как цифровой маркетинг, управление проектами и анализ данных. Эти программы позволили мне углубить мои знания и предложить инновационные решения технических задач.",
  "trainings": [
    {
      "title": "Специализация по генеративному ИИ для разработчиков программного обеспечения",
      "institution": "IBM на Coursera",
      "location": "Онлайн",
      "period": "07/2025",
      "badgeId": "eb664a77-dc7b-43f3-85aa-7d879961a6b9",
      "description": "Эта специализация позволила мне погрузиться в мир генеративного ИИ, применяемого в разработке программного обеспечения. Я научился интегрировать инструменты и модели ИИ в процесс разработки для создания более умных и эффективных приложений. Эта программа также позволила мне изучить реальные примеры использования генеративного ИИ в разработке ПО, что дало мне возможность предложить инновационные решения и оптимизировать процессы разработки."
    },
    {
      "title": "Специализация по генеративному ИИ для аналитиков данных",
      "institution": "IBM на Coursera",
      "location": "Онлайн",
      "period": "07/2025",
      "badgeId": "75f3e405-e1fe-4ca7-b3c3-c663c25360c6",
      "description": "Эта программа позволила мне открыть для себя влияние генеративного ИИ в области анализа данных. Я научился использовать генеративные модели для повышения эффективности анализа данных и получения инсайтов из сложных данных. Она также дала мне понимание интеграции ИИ в процессы анализа для автоматизации некоторых задач и максимизации ценности данных."
    },
    {
      "title": "Профессиональный сертификат IBM по управлению продуктами",
      "institution": "IBM на Coursera",
      "location": "Онлайн",
      "period": "06/2025 – 07/2025",
      "badgeId": "07dc0fc0-9eeb-4ec7-9097-d3b61a11e0c4",
      "description": "Эта программа помогла мне лучше понять управление продуктами и его связь с разработкой программного обеспечения. Я научился определять приоритеты продуктов, эффективно работать с командами продукта и интегрировать бизнес-требования в технические решения. Это обучение помогло мне лучше ориентироваться между управлением продуктом и технической разработкой, укрепив мою способность участвовать в сложных проектах."
    },
    {
      "title": "Сертификат по продвинутому анализу данных от Google",
      "institution": "Google на Coursera",
      "location": "Онлайн",
      "period": "12/2024 – 01/2025",
      "badgeId": "e5e58555-0079-4ff0-8d6e-519f655578a4",
      "description": "Я прошел продвинутую программу по анализу данных от Google на Coursera, которая позволила мне улучшить мои навыки анализа данных на более высоком уровне. Эта программа научила меня использовать продвинутые аналитические инструменты для решения сложных задач, овладеть техниками визуализации данных и применять статистические методы для интерпретации больших наборов данных. Благодаря этому сертификату я лучше подготовлен к проведению глубокого анализа и предоставлению стратегических рекомендаций на основе данных."
    },
    {
      "title": "Анализ данных",
      "institution": "Google на Coursera",
      "location": "Онлайн",
      "period": "11/2024 – 12/2024",
      "badgeId": "22db3e6a-8454-4b48-b168-9ca96546bb7c",
      "description": "Я завершил программу Google Data Analytics на Coursera, которая дала мне прочную основу в анализе данных. Этот курс помог мне освоить навыки, необходимые для анализа сложных данных, интерпретации результатов и принятия решений на основе данных. Благодаря этому обучению я могу превращать сырые данные в ценные инсайты для разработки маркетинговых стратегий и улучшения бизнес-операций."
    },
    {
      "title": "Основы цифрового маркетинга",
      "institution": "Google Digital Garage",
      "location": "Онлайн",
      "period": "10/2022",
      "badgeId": "",
      "description": "В октябре 2022 года я прошел курс по основам цифрового маркетинга в Google Digital Garage. Этот курс помог мне понять ключевые принципы цифрового маркетинга, включая стратегическое планирование, управление рекламными кампаниями и анализ данных для оценки эффективности. Я научился использовать различные инструменты и платформы для оптимизации онлайн-присутствия и привлечения целевой аудитории, что является ценным дополнением к моим техническим навыкам."
    }
  ],
  "meta": {
    "title": "Дополнительное обучение – Илия Глазунов",
    "description": "Изучите специализированные курсы Илии Глазунова по генеративному ИИ, анализу данных, управлению продуктами и цифровому маркетингу, которые повышают его технические и профессиональные навыки.",
    "keywords": "дополнительное обучение, генеративный ИИ, анализ данных, управление продуктом, цифровой маркетинг, Coursera, IBM, Google, Илия Глазунов",
    "image": "/images/photo.jpg"
  }
}
